homework/app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.all
---
SELECT "theaters".* FROM "theaters"

  def show
    @theater = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 2 LIMIT 1

  def create
    t = Theater.new
    t.name = params[:name]
    t.address = params[:address]
    t.phone_number = params[:phone_number]
    t.save
---
INSERT INTO "theaters" ("address", "created_at", "name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @theater = Theater.find_by_id(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1

  def update
    @theater = Theater.find_by_id(params[:id])
    @theater.name = params[:name]
    @theater.address = params[:address]
    @theater.phone_number = params[:phone_number]
    @theater.save
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
UPDATE "theaters" SET "phone_number" = '(773) 702-8574', "updated_at" = '2013-04-26 21:32:13.699383' WHERE "theaters"."id" = 1

  def destroy
    t = Theater.find_by_id(params[:id])
    t.destroy
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = 1 LIMIT 1
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 1]]